import { FaTh, FaTable,  FaHome, FaLayerGroup } from 'react-icons/fa';

export const menu = [
      {
            id: 1,
            lable: 'หน้าหลัก',
            icon: <FaHome/>,
            path: '/dashboard'
      },
      {
            id: 2,
            lable: 'ฟีดของคุณ',
            icon: <FaTable/>,
            path: '/feed'
      }
      // ,      
      // {
      //       id: 3,
      //       lable: 'กลุ่มของคุณ',
      //       icon: <FaLayerGroup/>,
      //       path: '/group'
      // },
]

export const userpost = [
      {
            id: 1,
            lable: 'JobThai',
            name: 'Jonh dan',
            massages: 'เพิ่งลาออกจากงานแบบไม่มี เงินสำรองเนื่องจากบน Office Toxic จนสภาพจิตใจแย่มาก ตอนนี้รู้สึกเคว้งและสิ้นหวัง ขอกำลังใจเพื่อสู้ต่อหน่อยคะ',
            time: '15 minutes ago',
            img: 'https://www.w3schools.com/css/img_5terre.jpg'
      },
      {
            id: 2,
            lable: 'Line Developer',
            name: 'USerGroup',
            massages: 'วันนี้พาลูกมาเพิ่มประกันเป็น Care+ ซึ่งประกันติดเครื่อง 1 ปีเหลืออีกแค่ 10 วัน ทีแรกก็เข้าใจว่า ทุกๆ AASP สามารถทำเรื่องซื้อได้หมด พอดีบ้านอยู่ลำปาง ก็เห็นว่ามี iService เป็น AASP เหมือนกัน ดีที่ลองโทรถามก่อน ปรากฏว่า ไม่ขาย!!! พร้อมกับให้ลองโทรติดต่อ support ดูก่อน พนักงาน support ก็ไม่สามารถบอกได้ว่า AASP ที่ไหนสามารถซื้อได้บ้าง ให้สอบถามเอาเอง ซึ่งก็หนีไม่พ้นการวัดดวงโทรไปหา iCare สาขา MAYA เชียงใหม่ดูก่อน เพราะเข็ดกับลีลาการให้บริการที่สาขา Central Airport แถมรีวิว1ดาวรัวๆ ไม่อยากจะร่วมสังฆกรรมด้วยอีกต่อไป ซึ่งก็โชคดีที่สาขาใหม่นี้ขายให้ด้วย',
            time: '15 minutes ago',
            img: 'https://www.w3schools.com/css/img_lights.jpg' 
      },     
      {
            id: 3,
            lable: 'กลุ่มของคุณ',
            name: 'American',
            massages: 'ทุกอย่างราบรื่นดี จ่ายเงินแล้วรอช่างตรวจเช็คภายในประมาณ 1 ชั่วโมง (ตรงนี้ก็สงสัยว่าถ้าตรวจไม่ผ่านเขาจะคืนเงินเต็มจำนวนมั้ย หรือคืนแต่จะขอหักค่าตรวจเช็ครึเปล่า)  เขาก็ขอให้ปิดFind My บังคับถอดเคส แต่ไม่บังคับลอกฟิล์มจอทิ้งแฮะ สภาพเครื่องของผมก็มีตำหนิขอบด้านซ้ายของ upper case มีแผลกระแทกจากก้นแก้วเซรามิคหน่อยนึง ท้องเครื่องมีรอยบุบบางๆจากกระดูกกำปั้นกระแทกใส่ แต่ก็ผ่านไปได้ด้วยดี จากนี้ไปอีก 3 ปี จะใช้แบบปล่อยจอย ไม่ถนอมแบบปีแรกแล้ว เราจะต้องใช้ประกันให้คุ้ม😆😆😆',            
            time: '35 minutes ago',
            img: 'https://www.w3schools.com/css/img_lights.jpg' 
      },
]

